Appiko/stm32h7x/F7_discovery_cam_trial/Src/main.c
}

void cam_shot_stop (uint32_t not_used)
{
    printf("%s\n", __func__);
    HAL_TIM_OC_Stop_IT (&htim1, TIM_CHANNEL_1);
    HAL_GPIO_WritePin (ARDUINO_A2_GPIO_Port, ARDUINO_A2_Pin, 0);
//    printf("Flash Reg : 0x%x\n",  CAMERA_IO_Read (CameraHwAddress,AR0135_FLASH));
    __HAL_DCMI_ENABLE_IT(&hdcmi, DCMI_IT_VSYNC);
    
}

void cam_flash_start (uint32_t flash_percent)
{
    printf("%s\n", __func__);
    uint32_t flash_ticks;
    flash_ticks = (g_expo_us * flash_percent)/100;
    flash_ticks = flash_ticks / 0.8333;
    HAL_GPIO_WritePin (ARDUINO_A0_GPIO_Port, ARDUINO_A0_Pin, 1);
    htim1.Instance->CCR2 = htim1.Instance->CNT + flash_ticks;
    HAL_TIM_OC_Start_IT (&htim1, TIM_CHANNEL_2);
    
}

void cam_flash_stop (uint32_t not_used)
{
    
    printf("%s\n", __func__);
    HAL_GPIO_WritePin (ARDUINO_A0_GPIO_Port, ARDUINO_A0_Pin, 0);
    HAL_TIM_OC_Stop_IT (&htim1, TIM_CHANNEL_2);
    HAL_TIM_OC_DeInit (&htim1);
}

void cam_save (uint32_t file_no)
{
    printf("%s\n", __func__);
//  uint32_t i, j;  
//  for(i = 0; i < PIX_H; i++)
//  {
//      img_bayer2rgb (i);
//  }

    static GPIO_InitTypeDef GPIO_InitStruct = {0};
//      HAL_DCMI_Stop (&hdcmi);
    img_compress_rgb ();
    HAL_Delay (1);
    write_sd_card (file_no);
    trig_init ();
    HAL_ADC_Start (&hadc3);
    printf("ADC value is : %d\n", HAL_ADC_GetValue (&hadc3));
//    cam_state = CAM_INIT;
//    cam_state_change = true;
//    cam_param = CAMERA_RAW;
//      HAL_DCMI_DeInit (&hdcmi);
//      HAL_DCMI_Init (&hdcmi);
}

int cambus_scan()
{
    for (uint8_t addr=0x08; addr<=0x77; addr++) {
        __disable_irq() ;
        if (HAL_I2C_IsDeviceReady(&hi2c1, addr << 1, 10, 100) == HAL_OK) {
            __enable_irq() ;
            return (addr << 1) ;
        }
        __enable_irq() ;
    }

    return 0;
}


void LCD_GPIO_Init(LTDC_HandleTypeDef *hltdc, void *Params)
{
    GPIO_InitTypeDef gpio_init_structure;
    /* Enable the LTDC and DMA2D clocks */
    __HAL_RCC_LTDC_CLK_ENABLE();
    __HAL_RCC_DMA2D_CLK_ENABLE();
    /* Enable GPIOs clock */
    __HAL_RCC_GPIOE_CLK_ENABLE();
    __HAL_RCC_GPIOG_CLK_ENABLE();
    __HAL_RCC_GPIOI_CLK_ENABLE();
    __HAL_RCC_GPIOJ_CLK_ENABLE();
    __HAL_RCC_GPIOK_CLK_ENABLE();
    /*** LTDC Pins configuration ***/
    /* GPIOE configuration */
    gpio_init_structure.Pin = GPIO_PIN_4;
    gpio_init_structure.Mode = GPIO_MODE_AF_PP;
    gpio_init_structure.Pull = GPIO_NOPULL;
    gpio_init_structure.Speed = GPIO_SPEED_FAST;
    gpio_init_structure.Alternate = GPIO_AF14_LTDC;
    HAL_GPIO_Init(GPIOE, &gpio_init_structure);
    /* GPIOG configuration */
    gpio_init_structure.Pin = GPIO_PIN_12;
    gpio_init_structure.Mode = GPIO_MODE_AF_PP;
    gpio_init_structure.Alternate = GPIO_AF9_LTDC;
    HAL_GPIO_Init(GPIOG, &gpio_init_structure);
    /* GPIOI LTDC alternate configuration */
    gpio_init_structure.Pin = GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_13 |
    GPIO_PIN_14 | GPIO_PIN_15;
    gpio_init_structure.Mode = GPIO_MODE_AF_PP;
    gpio_init_structure.Alternate = GPIO_AF14_LTDC;
    HAL_GPIO_Init(GPIOI, &gpio_init_structure);
    /* GPIOJ configuration */
    gpio_init_structure.Pin
    = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 |
    GPIO_PIN_3 | GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7 | GPIO_PIN_5
    | GPIO_PIN_6 | GPIO_PIN_7 |GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10 |
    GPIO_PIN_11 | GPIO_PIN_13 | GPIO_PIN_14 | GPIO_PIN_15;
    gpio_init_structure.Mode
    = GPIO_MODE_AF_PP;
    gpio_init_structure.Alternate = GPIO_AF14_LTDC;
    HAL_GPIO_Init(GPIOJ, &gpio_init_structure);
    /* GPIOK configuration */
    gpio_init_structure.Pin = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 |
        GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7;
    gpio_init_structure.Mode = GPIO_MODE_AF_PP;
    gpio_init_structure.Alternate = GPIO_AF14_LTDC;
    HAL_GPIO_Init(GPIOK, &gpio_init_structure);
    /* LCD_DISP GPIO configuration */
    gpio_init_structure.Pin = GPIO_PIN_12;
    gpio_init_structure.Mode = GPIO_MODE_OUTPUT_PP;
    /* LCD_DISP pin has to be manually controlled */
    HAL_GPIO_Init(GPIOI, &gpio_init_structure);
    /* LCD_BL_CTRL GPIO configuration */
    /* LCD_BL_CTRL pin has to be manually controlled */
    gpio_init_structure.Pin = GPIO_PIN_3;
    gpio_init_structure.Mode = GPIO_MODE_OUTPUT_PP;
    HAL_GPIO_Init(GPIOK, &gpio_init_structure);
}

static void LTDC_Init(uint32_t FB_Address,
uint16_t Xpos, uint16_t Ypos,
uint16_t Width, uint16_t Height)
{
    /* Timing Configuration */
    hltdc.Init.HorizontalSync = (RK043FN48H_HSYNC - 1);
    hltdc.Init.VerticalSync = (RK043FN48H_VSYNC - 1);
    hltdc.Init.AccumulatedHBP = (RK043FN48H_HSYNC + RK043FN48H_HBP - 1);
    hltdc.Init.AccumulatedVBP = (RK043FN48H_VSYNC + RK043FN48H_VBP - 1);
    hltdc.Init.AccumulatedActiveH = (RK043FN48H_HEIGHT + RK043FN48H_VSYNC +
    RK043FN48H_VBP - 1);
    hltdc.Init.AccumulatedActiveW = (RK043FN48H_WIDTH + RK043FN48H_HSYNC +
    RK043FN48H_HBP - 1);
    hltdc.Init.TotalHeigh = (RK043FN48H_HEIGHT + RK043FN48H_VSYNC +
    RK043FN48H_VBP + RK043FN48H_VFP - 1);
    hltdc.Init.TotalWidth = (RK043FN48H_WIDTH + RK043FN48H_HSYNC +
    RK043FN48H_HBP + RK043FN48H_HFP - 1);
    /* LCD clock configuration */
    periph_clk_init_struct.PeriphClockSelection = RCC_PERIPHCLK_LTDC;
    periph_clk_init_struct.PLLSAI.PLLSAIN = 192;
    periph_clk_init_struct.PLLSAI.PLLSAIR = RK043FN48H_FREQUENCY_DIVIDER;
    periph_clk_init_struct.PLLSAIDivR = RCC_PLLSAIDIVR_4;
    HAL_RCCEx_PeriphCLKConfig(&periph_clk_init_struct);
    /* Initialize the LCD pixel width and pixel height */
    hltdc.LayerCfg->ImageWidth
    = RK043FN48H_WIDTH;
    hltdc.LayerCfg->ImageHeight = RK043FN48H_HEIGHT;
    hltdc.Init.Backcolor.Blue = 0;/* Background value */
    hltdc.Init.Backcolor.Green = 0;
    hltdc.Init.Backcolor.Red = 0;
    /* Polarity */
    hltdc.Init.HSPolarity = LTDC_HSPOLARITY_AL;
    hltdc.Init.VSPolarity = LTDC_VSPOLARITY_AL;
    hltdc.Init.DEPolarity = LTDC_DEPOLARITY_AL;
    hltdc.Init.PCPolarity = LTDC_PCPOLARITY_IPC;
    hltdc.Instance = LTDC;
    if(HAL_LTDC_GetState(&hltdc) == HAL_LTDC_STATE_RESET)
    {
        LCD_GPIO_Init(&hltdc, NULL);
    }
    HAL_LTDC_Init(&hltdc);
    /* Assert display enable LCD_DISP pin */
    HAL_GPIO_WritePin(GPIOI, GPIO_PIN_12, GPIO_PIN_SET);
    /* Assert backlight LCD_BL_CTRL pin */
    HAL_GPIO_WritePin(GPIOK, GPIO_PIN_3, GPIO_PIN_SET);
    DrawProp[0].pFont = &Font24 ;
    /* Layer Init */
    layer_cfg.WindowX0 = Xpos;
    layer_cfg.WindowX1 = Width;
    layer_cfg.WindowY0 = Ypos;
    layer_cfg.WindowY1 = Height;
    layer_cfg.PixelFormat = LTDC_PIXEL_FORMAT_RGB888;
    layer_cfg.FBStartAdress = FB_Address;
    layer_cfg.Alpha = 255;
    layer_cfg.Alpha0 = 0;
    layer_cfg.Backcolor.Blue = 0;
    layer_cfg.Backcolor.Green = 0;
    layer_cfg.Backcolor.Red = 0;
    layer_cfg.BlendingFactor1 = LTDC_BLENDING_FACTOR1_PAxCA;
    layer_cfg.BlendingFactor2 = LTDC_BLENDING_FACTOR2_PAxCA;
    layer_cfg.ImageWidth = Width - Xpos;
    layer_cfg.ImageHeight = Height - Ypos;
    HAL_LTDC_ConfigLayer(&hltdc, &layer_cfg, 1);
    DrawProp[1].BackColor = ((uint32_t)0xFFFFFFFF);
    DrawProp[1].pFont = &Font24;
    DrawProp[1].TextColor = ((uint32_t)0xFF000000);
}

uint8_t CAMERA_Init(uint32_t Resolution) /*Camera initialization*/
{
//    memcpy ();
    uint8_t status = CAMERA_ERROR;
    CameraHwAddress = CAMERA_I2C_ADDRESS;
    /* Read ID of Camera module via I2C */
    if(ar0135_ReadID(CameraHwAddress) == AR0135_ID)
    {
        camera_driv = &ar0135_drv;/* Initialize the camera driver structure */
        {
            printf("Correct address.!\n");
            
            camera_driv->Init(CameraHwAddress, Resolution);
            HAL_DCMI_DisableCROP(&hdcmi);
        }
        status = CAMERA_OK; /* Return CAMERA_OK status */
    }
    else
    {
        status = CAMERA_NOT_SUPPORTED; /* Return CAMERA_NOT_SUPPORTED status */
    }
    return status;
}

uint8_t img_file_append (uint8_t * p_data, uint32_t len)
{
    static uint8_t res;
    static uint32_t byteswritten;
    res = f_write (&fp, p_data, len, (void *)byteswritten);
    return res;
    
