Appiko/stm32h7x/F7_discovery_cam_trial/Src/main.c
    }
    //else index is even : GR
    else
    {
        //run for start from green
        for(uint32_t raw_i = 0; raw_i < 320; raw_i++)
        {
            //0th byte || (PIX_W - 1)th byte:
            if (raw_i == 0 || raw_i == (320 - 1))
            {
                //all zeros
                _fb_base_lcd[index][raw_i].r = 0;
                _fb_base_lcd[index][raw_i].g = 0;
                _fb_base_lcd[index][raw_i].b = 0;
            }
            //check if odd byte : R
            else if(raw_i%2 != 0)
            {
                //red = reading
                _fb_base_lcd[index][raw_i].r = _fb_base_lr[index][raw_i];
                //green = horizontal and vertical avg
                _fb_base_lcd[index][raw_i].g = (_fb_base_lr[index][raw_i - 1]
                    + _fb_base_lr[index][raw_i + 1]
                    + _fb_base_lr[index - 1][raw_i]
                    + _fb_base_lr[index + 1][raw_i])/4;
                //blue = diagonal avg
                _fb_base_lcd[index][raw_i].b = (_fb_base_lr[index - 1][raw_i - 1] 
                    + _fb_base_lr[index - 1][raw_i + 1]
                    + _fb_base_lr[index + 1][raw_i - 1]
                    + _fb_base_lr[index + 1][raw_i + 1])/4;
            }
            //if even : Gr
            else
            {
                //red = horizontal avg
                _fb_base_lcd[index][raw_i].r = (_fb_base_lr[index][raw_i - 1] 
                    + _fb_base_lr[index][raw_i + 1])/2;
                //green = reading + diagonal corner
                _fb_base_lcd[index][raw_i].g = (_fb_base_lr[index][raw_i] 
                    + _fb_base_lr[index - 1][raw_i - 1] 
                    + _fb_base_lr[index - 1][raw_i + 1]
                    + _fb_base_lr[index + 1][raw_i - 1]
                    + _fb_base_lr[index + 1][raw_i + 1])/5;
                //blue = vertical avg
                _fb_base_lcd[index][raw_i].b = (_fb_base_lr[index - 1][raw_i] 
                    + _fb_base_lr[index + 1][raw_i])/2;
            }
        }
    }
    
    
    //append file
//    uint8_t status;
//     status = img_file_append (_fb_base_ppm, sizeof(_fb_base_ppm));
//     printf("%d : %d\n", index, status);
//     return status;
    return 0;
            
}
*/
/* USER CODE END 4 */

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM6 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM6) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
    printf("!!...Error...!!\n");

    while(1);
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{ 
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
